1. В чем разница между статическим и динамическим массивом и как понятие фактора роста связано с динамическими массивами?
- Статический массив имеет фиксированный размер который определяется во время компиляции. 
Размер статического массива не может изменяться после создания.
Размер у динамический массив может изменяться в процессе выполнения программы. 
Динамические массивы обычно реализуются с использованием динамической памяти.
- Фактор роста growth factor в динамических массивах относится к стратегии изменения 
размера массива при добавлении новых элементов. Динамические массивы обычно 
увеличивают свой размер в несколько раз чтобы уменьшить частоту перераспределения памяти.

2. Опишите процесс извлечения элемента из массива и объясните, почему он может быть сложным при работе с большими массивами.
- Процесс извлечения элемента из массива включает в себя доступ к ячейке памяти по индексу. 
Это обычно выполняется с использованием квадратных скобок arr[index].
Сложности могут возникнуть при работе с большими массивами из-за
времени выполнения - чем больше массив, тем дольше может занять поиск элемента.
Так же использования ресурсов - чем больше массив тем больше оперативной памяти могут потреблять.

3. Как объявляется инлайн-массив и какой атрибут используется для определения его длины?

[System.Runtime.CompilerServices.InlineArray(length: 10)]
public struct Buffer
{
    private object _element0;
}

4. Сравните и противопоставьте цикл while и цикл for с точки зрения синтаксиса и типичных случаев использования.
- Цикл while выполняется пока условие истинно. Используется когда заранее неизвестно количество итераций.
Цикл for используется для известного количества итераций. Включает в себя инициализацию, 
условие и шаг итерации в одной конструкции.

5. Что такое бесконечный цикл в программировании и как из него выйти?
- Это цикл который выполняется бесконечно не достигая условия завершения.
Для выхода из бесконечного цикла можно использовать ключевое слово 
break или изменить условие так чтобы цикл завершался.

Practice

1. Напишите программу, которая проверяет, содержится ли заданное число в массиве.

2. Создайте массив чисел. Используя цикл, найдите и выведите сумму всех элементов массива.

3. Создайте строку и используйте цикл для вывода каждого символа строки на новой строке.

namespace ConsoleApp1
{
    internal class Program
    {
        public static bool FindValue(int[] nums, int findValue)
        {
            var isValueFound  = false;
            var sumOfArrayValues = 0;

            foreach (var num in nums)
            {
                sumOfArrayValues += num;

                Console.WriteLine($"Number {num} is the ASCII-code for the symbol: {(char)num}");
                    
                if (num == findValue)
                {
                    isValueFound  = true;
                }
            }
            
            Console.WriteLine($"Sum of array values is: {sumOfArrayValues}");
            return isValueFound ;
        }
        
        private static void Main(string[] args)
        {
            var array = new[] { 104, 101, 108, 108, 111 };
            var findValue = 111;

            var isValueFound = FindValue(array, findValue);
            Console.WriteLine(isValueFound ? $"Value {findValue} found in array" : $"Value {findValue} not found in array");
        }
    }
}